#balance_registers
#ungroup -all -flatten
#compile -map_effort high -incremental_mapping
compile
report_area
report_power
report_timing
